Documents/ESB/ESB_Consumer_0728/003TestSample/SAMPLE_XML_MUST/DebitCard/DC13_CardCIFInfoModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://https://www.nextbank.com.tw//xsd/TW/DebitCard/CardCIFInfoModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>CardCIFInfoMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CardCIFInfoModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC13</v11:TxnId>  
        <v11:TxnNo>DC1300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CIFNo>5489700003</v11:CIFNo>  
        <v11:CardAtt>0</v11:CardAtt> 
      </v11:ServiceBody> 
    </v11:CardCIFInfoModRq> 
  </soap:Body> 
</soap:Envelope>
